<template>
  <div class="body">
    <div class="background">
      <div class="ori" dir="rtl">
        <form class="q-gutter-md">
          <div id="image2"><img alt="user" src="../../assets/user.png" width="100"></div>
          <h5 class="witchSign">התחברות</h5>
          <q-input v-if="!turn" v-model="localUser.email" placeholder="אימייל" style="margin-top: 60px"
                   type="email"></q-input>
          <q-input placeholder="סיסמא" ref="password" id="password" v-model="localUser.password"
                   :type="isPwd ? 'password' : 'text'">
            <template v-slot:append>
              <q-icon
                  :name="isPwd ? 'visibility_off' : 'visibility'"
                  class="cursor-pointer"
                  @click="isPwd = !isPwd"
              />
            </template>
          </q-input>
          <br>

          <div><br>
            <p class="forget" @click="goToForgot">שכחתי סיסמא</p>

            <q-dialog v-model="isFixed">
              <q-card>
                <q-card-section>
                  <div class="text-h6" dir="rtl" style="text-align: center">תקנון ותנאי שימוש</div>
                </q-card-section>
                <q-separator/>
                <q-card-section dir="rtl" style="max-height: 50vh" class="scroll">
                  <p>
                    1. מבוא
                    <br> ברוכים  הבאים לתוכנה האינטרנטית של חברת PicPic המתפרסמת באמצעות כתובות האינטרנט:<br>

                    www.picpic.co.il <br>
                    https://picpic-admin.web.app <br>
                    https://picpic-guest.web.app <br>

                    (להלן ובהתאמה: "החברה" ו-"האתר"). התוכנה מאפשרת לגולשים באתר ולמשתמשים בו גישה למוצרי החברה (להלן: ("המוצר/ים"), באתר ולבצע רכישות של אותם המוצרים באמצעות האתר, והכל בכפוף לתנאים המפורטים להלן (להלן: "תנאי השימוש" ו/או "התקנון").
                    2. האמור בתנאי השימוש מנוסח בלשון זכר מטעמי נוחות בלבד ומתייחס לנשים וגברים כאחד. בנוסף, האמור ביחיד מתייחס גם לרבים ולהיפך, בהתאמה הנדרשת.<br>
                    3. יובהר, תנאי השימוש מהווים הסכם התקשרות משפטי מחייב בין החברה לבין כל גולש ו/או צופה ו/או משתמש ו/או רוכש ו/או מבצע פעולה כלשהי ו/או משתמש בדרך כזו או אחרת וכן כל גוף משפטי כזה או אחר ו/או פרט, באתר ו/או במידע המצוי בו (להלן: "המשתמש"). <br>
                    4. אנא קרא את הוראות תנאי השימוש בקפידה ובעיון שכן השימוש באתר מעיד על הסכמתך לתנאים ועל אישורך את ההוראות הקבועות בו. ככל שאינך מסכים לתנאי מתנאי השימוש הנך מתבקש שלא לעשות כל שימוש באתר.<br>
                    5. יש להקפיד לעיין ולהתעדכן בתנאי השימוש מעת לעת. הפעילות באתר מהווה הסכמה מצד המשתמש לתנאי השימוש המפורטים להלן, ללא כל הגבלה או הסתייגות, ותנאים אלו עשויים להשתנות מעת לעת ,לפי שיקול דעתה הבלעדי של החברה, ולמשתמש לא תהיה כל טענה ו/או דרישה ו/או תביעה כנגד החברה ו/או מי מטעמה בקשר לכך. <br>
                    6. החברה תהא רשאית להפסיק את הפעילות באתר בכל עת (באופן מלא או חלקי), בהתאם לשיקול דעתה הבלעדי, מבלי שזו תהא מחויבת למתן הודעה מראש בדבר הפסקת הפעילות למשתמש. 
                    7. החברה שומרת לעצמה את הזכות למנוע את הגישה לאתר ו/או לאפשרות לבצע בו פעילות כלשהיא ו/או לבטל השתתפות של משתמש, שהתנהגותו בלתי הולמת ו/או בלתי ראויה ו/או חורגת מהאמור בתנאי השימוש הללו ו/או מעלה חשש בדבר ניסיון לפגיעה בניהולו התקין של האתר ו/או בניהולה התקין של החברה.<br>
                    8. המשתמש מצהיר כי הינו בגיר (מעל גיל 18) וכי הוא רשאי לבצע רכישות באתר כדין.<br>
                    9. תקנון זה יחול על רכישות המבוצעות באתר בין שהוא מופעל באמצעות הכתובת המופיעה לעיל בסעיף 1 ובין שיופיע בעתיד תחת כתובת אחרת.<br>
                    10. משתמש המבקש לשאול שאלות בקשר עם האמור בתקנון זה, ובכלל בנושאים אחרים, מוזמן לפנות לחברה באמצעות דף "צור קשר" המופיע בעמוד האתר.<br>

                    2. תנאי שימוש והרכישה<br>
                    1. ביצוע הרכישות באתר יתאפשר בכפוף להתקיימות התנאים שלהלן במצטבר:<br>
                    א. המשתמש הינו בגיר (מעל גיל 18) וכשיר לבצע פעולות משפטיות מחייבות.<br>
                    ב. המשתמש הינו בעל כרטיס אשראי ישראלי תקף, שהונפק בישראל על ידי אחת מחברות כרטיסי האשראי.<br>
                    ג. הרכישה הינה לצריכה פרטית בלבד ולא סיטונאית.<br>
                    ד. המשתמש הינו בעל תיבת דואר אלקטרוני פעילה ונגישה ברשת האינטרנט ובעלת כתובת לקבלת דואר בישראל.<br>
                    2. החברה תהא רשאית, על פי שיקול דעתה הבלעדי, מכל סיבה שהיא, ללא צורך במתן הנמקה ו/או הודעה מראש, שלא לאפשר למשתמש ו/או קבוצת משתמשים את השימוש באתר, בין אם אושר שימוש כזה בעבר ובין אם לאו, לרבות להפסיק ו/או לחסום את הגישה לרכישה ו/או הגלישה באתר.<br>
                    3. החברה אינה מתחייבת לכלל התכנים ו/או השירותים האמורים, כולם או מקצתם, באופן שוטף באתר ונתון לה שיקול הדעת הבלעדי לשינוי רשימת התכנים ו/או השירותים הניתנים באתר, לשינוי מבנה האתר, מראהו, עיצובו, את היקפם וזמינותם של התכנים ו/או השירותים המוצעים במסגרתו וכן כל היבט אחר הכרוך באתר, וזאת ללא צורך במתן הודעה למשתמשים בו, אשר על כן, לא תהא למי מהמשתמשים כל טענה ו/או דרישה ו/או תביעה כלפי החברה בגין ביצוע שינויים כאמור ו/או תקלות שיתרחשו אגב ביצועם. מבלי לגרוע מהאמור לעיל, החברה רשאית לעדכן את דף המוצר מעת לעת, להוסיף או להשמיט פרטים, להסיר מוצרים שאזלו מן המלאי וכן לעדכן ו/או לשנות את מחיר המוצר מעת לעת והכול לפי שיקול דעתה הבלעדי. מובהר בזאת כי התמונות באתר הן להמחשה בלבד, ייתכנו שינויים בין התמונות ובין המוצרים בפועל, אשר נובעים, בין היתר, מן העובדה כי המוצרים מצולמים ומוצגים על גבי מסך מחשב ולמשתמש לא תהא כל טענה ו/או דרישה ו/או תביעה בקשר לכך.<br>
                    4. החברה רשאית להציע, מעת לעת, הנחות, הטבות ומבצעים באתר או בכל אמצעי תקשורת אחר, לרבות באמצעות דואר אלקטרוני או הודעת טקסט, בהתאם לתנאי אותן הטבות, כפי שיפורסמו באותו אמצעי תקשורת והכול ע"פ שיקול דעתה הבלעדי. החברה תהא רשאית בכל עת להפסיק את ההנחות, ההטבות והמבצעים הללו, להחליפם ו/או לשנותם.<br>
                    5. אין כפל הנחות.<br>
                    6. כחלק בלתי נפרד מהליך ביצוע הרכישה, יתבקש המשתמש להקליד פרטים בסיסיים כגון שם ושם משפחה, כתובת, כתובת דואר אלקטרוני, מספר טלפון ומספר כרטיס אשראי שבאמצעותו יבוצע התשלום בגין הרכישה. יש להקפיד על מסירת הפרטים הנכונים והמדויקים על מנת להבטיח את ביצוע ההזמנה (להלן: "ההזמנה") .<br>
                    7. המשתמש מאשר לחברה לשלוח לו תזכורת אודות מוצרים, הנחות ועדכונים אחרים באמצעות שליחת דוא"ל לכתובת שהוזנה ע"י המשתמש ו/או שליחת מסרון לטלפון הנייד של המשתמש.<br>
                    8. מסירת פרטים כוזבים ביודעין עלולה לעלות לכדי עבירה פלילית. נגד משתמש שיספק פרטים כוזבים עלולים להינקט צעדים משפטיים אזרחיים ופליליים, לרבות תביעות נזיקין בגין נזקים שיגרמו לחברה עקב שיבוש הפעלת האתר.<br>

                    3. הגבלת אחריות<br>
                    1. השימוש במוצר ממוצרי החברה הינו על אחריותו הבלעדית של הרוכש ועל חשבונו.<br>
                    2. החברה לא תהיה אחראית, בכל מקרה, כלפי רוכש בקשר עם המוצר ואחריות השימוש הבלעדית חלה על הרוכש.<br>
                    3. יובהר, ככל שרשות מרשויות המדינה, לרבות אך לא רק, משרד המדע והטכנולוגיה ו/או משרד הפנים ו/או כל רשות אחרת, תחליט על איסור כזה או אחר, חלקי או מלא בשימוש ו/או בהרכבת המוצר אזי שלרוכש ו/או למשתמש לא תהיה כל טענה ו/או כל דרישה ו/או תביעה כנגד החברה ו/או מי מטעמה בקשר לכך והאחריות הבלעדית לרכישה ו/או לשימוש הינה על הרוכש ו/או המשתמש בלבד ועל חשבונם הבלעדי. <br>
                    4. מובהר בזאת כי *אין אחריות לכל הנעשה בחשבון של המשתמש*.שכן המשתמש אחראי על מחיקה/ הוספה/ עדכון/ קריאה של כל תמונה/ אירוע/ קטגוריה כזו או אחרת בחשבון המשתמש. בנוסף, אין אחריות לכל הנעשה לרולאפ. גנבתו, הריסתו, נזק שנגרם לו במכוון או לאו, נזק שנגרם כתוצאה מבלאי או אם בכל דרך אחרת בה נמנע ו/או לא מתאפשר השימוש בו וכיוצא בזאת הינה על אחריותו של המשתמש. רכישה נוספת של רולאפ תתבצע ע"י שליחת מייל לכתובת האתר: app.picpic@gmail.com   או ע"י שליחת הבקשה לטלפון : 054-546-4144. הרולאפ החדש יסופר תוך 14 יום בהאם למפורט בתקנון.<br>
                    החברה לא מספקת אחריות על המוצר ולרוכש ו/או למשתמש לא תהיה כל טענה ו/או כל דרישה ו/או תביעה כנגד החברה ו/או מי מטעמה בקשר לכך והאחריות הבלעדית הינה על הרוכש ו/או המשתמש ועל חשבונם הבלעדי. 
                    5. החברה ו/או מי מטעמה לא יהיו אחראים בשום מקרה לכל פגיעה, מוות, תאונה, עיכוב, נזק ישיר או עקיף, אגבי, עונשי, מיוחד, דוגמתי או תוצאתי הנובע משימוש או חוסר היכולת להשתמש (מכל סיבה) בכל חלק של האתר ו/או המוצרים של החברה, לרבות אך לא רק, אי דיוקים או שגיאות במידע כתוצאה מגישה לאתר זה ו/או כתוצאה הנובעת ממנו, לרבות אך לא רק, רכישת המוצר ושימוש בו, פעולה או חוסר פעולה בקשר עם תנאים אלו, או הצהרות או התנהלות של המשתמש או של כל צד שלישי באתר זה או באתר האינטרנט.<br>
                    6. השימוש באתר נעשה באחריותו המלאה של המשתמש בלבד. מובהר, כי החברה ו/או מי מטעמה לא יהיו אחראים ולא יישאו בכל נזק (ישיר ו/או עקיף ו/או תוצאתי ו/או אחר) שנגרם למשתמש ו/או לצד ג', כתוצאה משימוש ו/או רכישה באמצעות האתר ו/או כתוצאה משימוש במוצר ממוצרי החברה, מכל סיבה שהיא, לרבות הפסד הכנסה ו/או מניעת רווח ו/או הפסד שיגרם למשתמש מכל סיבה שהיא.<br>
                    7. לא יהיה למשתמש באתר כל טענה ו/או תביעה ו/או דרישה כלפי החברה בקשר עם האתר, המוצרים המוצעים במסגרתו או תכניו.<br>
                    8. החברה אינה מתחייבת, כי תכני האתר (לרבות תכני המשתמש) יהיו מלאים, נכונים, חוקיים, מדויקים או יהלמו את ציפיות ו/או דרישות המשתמש.<br>
                    9. אין לראות בתכני האתר משום המלצה לבצע רכישה ו/או חוות דעת על המוצר ו/או השירות בכל מקרה.<br>
                    10. החברה אינה מתחייבת לשמור על זמינות האתר ו/או זמינות תכני האתר ו/או שירותי האתר. מובהר, כי האתר, תכניו והשירותים הניתנים במסגרתו אינם חסינים מפני גישה בלתי-מורשית למחשבי החברה או מפני נזקים, קלקולים, תקלות או כשלים - בין בחומרה, בין בתוכנה, בין בקווי ובמערכות תקשורת, בין אצל החברה ובין אצל הנהלת האתר - ולא יהא באלה כדי להטיל על החברה איזו אחריות ו/או להקים זכות למי מהמשתמשים. לא יהיה למשתמשים כל טענה ו/או דרישה ו/או תביעה כנגד החברה ו/או מי מטעמה בקשר לכך.<br>
                    11. מבלי לגרוע מכלליות האמור לעיל, יובהר, החברה אינה אחראית לכל נזק שיגרם על ידי וירוסים ו/או נוזקה אחרת העלולה להדביק את המכשיר(ים) של המשתמש במהלך השימוש באתר.<br>

                    4. שיפוי<br>
                    1. המשתמש באתר מתחייב לשפות את החברה, עובדיה, מנהליה ו/או מי מטעמה בגין כל נזק, הפסד, אבדן-רווח, תשלום או הוצאה שייגרמו להם ובכלל זה הוצאות שכ"ט עו"ד והוצאות משפט - עקב הפרת תנאי שימוש אלה, וזאת מבלי לגרוע מזכויותיה של החברה בהתאם לכל דין. בנוסף, יפצה ו/או ישפה המשתמש את החברה, עובדיה, מנהליה ו/או מי מטעמה בגין כל טענה, תביעה או דרישה שתועלה נגדם על-ידי צד ג' כלשהוא כתוצאה מכל שימוש אותו עשה המשתמש בקשר עם האתר.<br>
                    2. המשתמש נותן את הסכמתו המפורשת בעצם השימוש באתר זה, כי מבלי לפגוע בכל זכות אחרת של החברה, במקרים בהם החברה תחשוש כי השימוש של המשתמש באתר אינו מתיישב עם הוראות תנאי שימוש אלה ו/או כל דין, היא תהא רשאית להתחקות אחר השימוש של המשתמש באתר, בכפוף לכל דין, וכן היא שומרת לעצמה את הזכות הבלעדית להפסיק באופן מידי את שימוש המשתמש באתר, וזאת מבלי לגרוע מכל זכות אחרת העומדת לזכות החברה על פי דין.<br>

                    5. תשלומים<br>
                    1. במעמד ביצוע ההזמנה החברה תבדוק את פרטי כרטיס האשראי ועם קבלת אישור ההזמנה ע"י חברות כרטיסי האשראי, תימסר למשתמש הודעה כי ההזמנה אושרה.<br>
                    2. יובהר, משלוח ההודעה כאמור אינו מהווה ראיה על השלמת הפעולה כאמור ואינו מחייב את החברה. רישומי המחשב של החברה יהוו ראיה חלוטה לביצוע ההזמנה כאמור. עוד מובהר כי חיוב הפעולה בגין עלות המוצר והמשלוח הנרכש על ידה, יתבצע באמצעות כרטיס האשראי מיד עם סיום ביצוע ההזמנה ורק לאחר קבלת אישור מחברות האשראי על ביצוע החיוב, בהתאם לנהלי העבודה הקיימים בינן לבין החברה, תיחשב העסקה כמאושרת על ידי החברה.<br>
                    3. מקרה בו לא אושרה העסקה ע"י חברת האשראי יקבל המשתמש הודעה מתאימה. מובהר, כי במקרה כזה ייראו את ההזמנה כאילו לא בוצעה, ולמשתמש לא תהא כל טענה ו/או דרישה ו/או תביעה כנגד החברה בעניין זה. <br>
                    4. השלמת עסקת הרכישה מותנית בכך שהמוצרים המבוקשים קיימים במלאי בעת השלמת הליך ההזמנה.<br>
                    5. במקרה שמוצר אזל מן המלאי ו/או שישנה בעיה באספקתו, מכל סיבה שהיא, תהא החברה רשאית להודיע למשתמש על ביטול ההזמנה ובהתאם יבוטל החיוב בכרטיס האשראי על ידי החברה מול חברות כרטיסי האשראי.<br>
                    6. הודעה כאמור תימסר למשתמש באמצעות דואר אלקטרוני ו/או בהודעה טלפונית ו/או בהודעת מסרון לטלפון הנייד שלו, זאת, בהתאם לשיקול דעתה הבלעדי של החברה ובהתאם לפרטים המצויים ברשותה.<br>
                    7. במקרה כאמור, לא תהא למשתמש טענה כלשהיא כנגד החברה ובעצם ביצוע ההזמנה, מוותר המשתמש על כל טענה כאמור בהתאם לתקנון זה. החברה שומרת לעצמה את הזכות להגביל את כמות המוצרים ו/או את סכום ההזמנה, בכל הזמנה, בהתאם לשיקול דעתה הבלעדי.<br>
                    8. התשלום בעבור המוצרים באתר מבוצעות ע"י "איש משרד"  ו "UPAY". ההוראות החלות לגבי כרטיסי אשראי בתנאי שימוש אלו, יחולו גם לגביהם בשינויים המחויבים.<br>

                    6. מדיניות משלוחים ואיסוף הרולאפ:
                    1. המשתמש יהיה רשאי לבחור בין איסוף המוצר לבין ביצוע משלוח ליעד שיבחר. במקרה של איסוף, המשתמש יוכל לאסוף את ההזמנה שביצע באתר בתוך 2 ימי עסקים ולאחר קבלת הודעה לדואר האלקטרוני ו/או לטלפון הנייד שלו ו/או הודעה טלפונית שתימסר על ידי החברה, כאמור לעיל בפרק התשלומים, כי המוצרים ממתינים למשתמש במקום האיסוף.<br>
                    2. מקום האיסוף יהא ברחוב האר"י 3 רחובות (להלן: "בית העסק") ובשעות הפעילות בימי חול בין השעות 9:30-17:00 ובימי שישי בין השעות 09:30-13:00. יצוין כי יכול ומעת לעת מועדי פתיחת העסק ומיקומו ישתנו. יש לשים לב להנחיות כפי שישלחו כאמור ע"י החברה.<br>
                    3. בחר המשתמש במשלוח המוצרים, יהיה המשתמש רשאי לבחור במשלוח ישירות לביתו ו/או ליעד אחר, לפי בחירתו. יובהר, משלוח המוצר יהיה על חשבונו של המשתמש ועל אחריותו.<br>
                    4. החברה תספק את המוצרים שהוזמנו כאמור לחברת השילוח החיצונית (להלן: להגדיר את המשלוחים) ופרטים נוספים כגון פרטי כתובת אותה ציין המשתמש באתר בעת הזמנתו. תשלום עבור המשלוח יתבצע באמצעות כרטיס האשראי ויצטרף לתשלום עבור המוצרים ולא יהיה ניתן לביטול מכל סיבה שהיא, למעט על פי הוראות הדין החל.<br>
                    5. אספקת המוצרים מהאתר נעשית על ידי שימוש בחברת שילוח חיצונית ונעשית בכפוף למדניות חברת השילוח, כפי שתתעדכן מעת לעת והחברה אינה אחראית, בכל מקרה, לפעילות ופעולות חברת השילוח החיצונית.<br>
                    6. זמני אספקת המוצרים כפי שמצוינים באתר הינם במונחי "ימי עסקים" בלבד, קרי, ימי חול, מראשון ועד חמישי, ואינם כוללים את ימי שישי ושבת, ערבי חג וימי חג (כולל חול המועד).<br>
                    7. הזמנה שבוצעה לאחר השעה 16:00 או ביום שאינו יום עסקים, תחשב לצורך חישוב מועד האספקה של חברת השילוח, כאילו בוצעה ביום העסקים שלמחרת.<br>
                    8. יתכן שזמן האספקה ליישובים, עיירות, מושבים, קיבוצים, מועצות ויעדים מרוחקים יהיה ארוך מהרגיל וכאמור הינו תלוי במועדי וזמני אספקת המשלוחים אצל חברת השילוח.<br>
                    9. במקרה שחברת השילוח לא מבצעת משלוחים ליעד שציין המשתמש באתר אזי שאיסוף המוצר הנרכש יהיה על אחריותו ועל חשבונו הבלעדי של המשתמש ממקום האיסוף האמור בסעיף 2 לפרק זה.<br>
                    10. מובהר בזאת כי זמני האספקה המפורטים לעיל הינם זמנים משוערים וכי ייתכנו שינויים ו/או עיכובים בזמני האספקה עקב נסיבות התלויות בחברת השילוח ו/או צדדי ג' אחרים, ושאינם תלויים בחברה.<br>
                    11. המשתמש מאשר כי ידוע לו כי יכול ואספקת המוצרים תעשה בתוך זמן קצר או ארוך יותר מן הזמן המשוער וכן, מאשר המשתמש כי ידוע לו שהחברה בכל מקרה לא תהא אחראית לאיחור באספקת המוצרים במקרים אלו, לרבות אך לא רק, במצבים של "כוח עליון" ומבלי לפגוע בכלליות האמור, מלחמה, פעולות איבה, מצבי חרום ונזקי טבע ו/או שביתה ו/או השבתה חלקית ו/או מלאה ו/או סגר חלקי ו/או סגר מלא אצל ספקי הסחורות הדרושים לייצור ו/או הובלת המוצרים וכן מכל סיבה אחרת, שאינה בשליטת החברה.<br>
                    12. משלוחים לא יבוצעו לאזורים המוגבלים לגישה מבחינה ביטחונית.
                    13. מובהר בזאת כי החברה אינה מתחייבת לזמן אספקה, כפי שהובהר לעיל. החברה לא תהא אחראית לכל עיכוב באספקת המוצרים למשתמש ו/או אי אספקתם, שייגרם בשל פרטים שגויים ו/או לא מדויקים ו/או בלתי מלאים, שמסר המשתמש ו/או בשל כל סיבה אחרת.<br>
                    14. אספקת המוצרים תותנה בהצגת תעודת הזהות של המשתמש וכן בהצגת מספר אישור ההזמנה ו/או קבלה כפי שיתקבל ממערכת ההזמנות בגין ביצוע העסקה, זאת עפ"י שיקול דעתה הבלעדי והמוחלט של החברה.<br>
                    15. מוסכם כי החברה ו/או מי מטעמה יהיו רשאים לדרוש כל אמצעי זיהוי נוסף, עפ"י שיקול דעתה של החברה, כתנאי למסירת המוצרים לידי המשתמש.<br>

                    7. מדיניות ביטול עסקה
                    1. יהיה המשתמש רשאי לבטל את העסקה בהתאם ובכפוף להוראות התקנון ובכפוף להוראות חוק הגנת הצרכן, התשמ"א – 1981 והתקנות מכוחו (החוק והתקנות יכונו יחד להלן: "חוק הגנת הצרכן").<br>
                    2. ביטול העסקה חשופה ונתונה למשתמש באתר 24/7, 365 יום בשנה. בהתאם להוראות חוק הגנת הצרכן ויוכל לבטל בכל שלב שירצה.<br>
                    משתמש בתעריף חודשי- משלם בהוראת קבע כ 350 ₪/חודשי.<br>
                    משתמש בתעריף חצי שנתי- משלם בהוראת קבע כ 1750 ₪/חצי שנה.<br>
                    משתמש בתעריף שנתי- משלם בהוראת קבע כ 2850 ₪/שנתי.<br>
                    בכל מקרה של ביטול, הרשאות האתר לאותו משתמש בסוף אותו חודש יבוטלו ולא תותר לו כניסה נוספת אלא אם מבצע רכישה מחודשת.<br>
                    3. ביטול העסקה או החלפת המוצר תעשה באמצעות האתר תחת קטגוריית<br>
                    "חשבון" > "הגדרות משתמש" > "התנתקות מהמערכת".
                    4. המוצר המוצג באתר. התמונות ו/או התיאורים ו/או העיצובים של המוצרים באתר נועדו להמחשה בלבד.<br>
                    5. לא יותרו החזרים כספיים ללקוחות לאחר ביצוע תשלום. החברה רשאית לגבות דמי ביטול, כמפורט בסעיף 2 לעיל בפרק זה.<br>
                    6. החברה שומרת לעצמה את הזכות להפסיק בכל עת, על פי שיקול דעתה, או לבטל עסקת רכישה שביצע משתמש, לרבות אך לא רק, בכל אחד מהמקרים הבאים:<br>
                    א. בכל מקרה שבו נעשתה פעולה בניגוד לתנאי שימוש אלה.<br>
                    ב. לאחר סיום עסקת הרכישה התברר כי המוצר אזל מהמלאי.<br>
                    ג. לא נקלטו במערכת פרטי כרטיס האשראי ופרטיו המלאים של המשתמש.<br>
                    ד. המשתמש פעל באופן בלתי חוקי ו/או בניגוד להוראות הדין.<br>
                    ה. המשתמש מסר בעת ביצוע עסקת הרכישה ו/או לאחר מכן פרטים שגויים.<br>
                    ו. המשתמש ביצע מעשה או מחדל שיש בו כדי לפגוע בחברה ו/או במי מטעמה ו/או בפעילותו התקינה של האתר ו/או בצד ג' אחר כלשהוא.<br>
                    ז. החברה סבורה כי בכוונת המשתמש למכור את המוצרים לצד ג' כלשהוא. בהקשר זה המשתמש מאשרת ומתחייב כי לא ימכור מוצרים שרכש באתר לצד ג' כלשהוא.<br>
                    ח. המשתמש לא קיבל את המשלוח שהוזמן תוך 14 ימי עסקים.<br>
                    ט. במקרה בו אין באפשרות החברה לבצע ניהול תקין של האתר, לספק למשתמש את המוצרים ו/או לעמוד בהתחייבות אחרת שלה, וזאת בשל כוח עליון כהגדרתו לעיל, לרבות אך לא רק, תקלות מחשב ו/או תקלות במערכת טלפונים ו/או תקלות במערכות תקשורת אחרות, חבלה כלשהי או אירוע בטחוני.<br>
                    7. בנסיבות כאמור רשאית החברה לבטל את העסקה, ללא חיוב דמי ביטול. בוטלה המכירה כאמור לא תהא החברה אחראית ולא תישא, בכל מקרה, בכל נזק ישיר, עקיף, תוצאתי או מיוחד שנגרם למשתמש או לצד שלישי, לרבות אך לא רק נזק בגין רכישת המוצר ו/או השרות.<br>
                    8. עוד מובהר כי במקרה של החזרת מוצר שנרכש במסגרת הנחה/הטבה/מבצע, ובתנאים המזכים את המשתמש בהחזר כספי, ככל שזה יבטל את העסקה במועד האמור בסעיף 3 לעיל אזי שהסכום שיוחזר למשתמש יהיה הסכום ששילם בפועל לאחר הנחה/הטבה.<br>

                    8. קניין רוחני<br>
                    1. כל זכויות הקניין הרוחני בקשר עם המוצר והאתר וכל תוצר הנובע ו/או הנלווה להם (וזאת בין אם מדובר בזכויות רשומות או בזכויות שטרם נרשמו), לרבות המדגמים, העיצובים, סימני המסחר, הפטנטים, זכויות היוצרים, השיטות והסודות המסחריים, אופן הצגתו ועיצובו של האתר, בסיסי הנתונים בו (לרבות רשימות המוצרים והשירותים, תיאור המוצרים והשירותים, העיצובים, האיורים, הצילומים, התמונות, המפות, קטעי האודיו, קטעי הווידאו, הטקסט, הגרפיקה וכיוצא באלו), קוד המחשב של האתר, ה- Domain וכל פרט אחר הקשור באתר ובהפעלתו, הינם רכושה הבלעדי של החברה והשימוש בכל הזכויות האמורות שייך לחברה באופן בלעדי (להלן: "המידע"). <br>
                    2. אין להעתיק, לשכפל, לפרסם, להפיץ, לשדר, להציג, לבצע, להנפיק רישיון, ליצור עבודות נגזרות, למכור, לשווק ולתרגם כל חלק מן המידע הכלול באתר (לרבות אך לא רק סימני מסחר, מדגמים, שרטוטים, תמונות, טקסטים, קוד מחשב וכל סוג מידע אחר) בלא קבלת רשותה המפורשת של החברה מראש ובכתב.<br>
                    3. אין לעשות כל שימוש מסחרי או אחר במידע ו/או בנתונים המתפרסמים באתר, בבסיס הנתונים באתר, ברשימות המוצרים המופיעים בו או בפרטים אחרים המתפרסמים באתר בלא קבלת הסכמתה של החברה מראש במפורש ובכתב ואין לעשות כל פעולה העלולה לפגוע בזכויות הקניין של החברה, מכל סוג שהוא.<br>
                    4. אין להשתמש במידע ו/או המתפרסם באתר לצורך הצגתו באתר אינטרנט ו/או בשירות אחר כלשהו, בלא קבלת הסכמתה המפורשת של החברה מראש ובכתב.<br>
                    5. אין לאסוף נתונים מן האתר באמצעות תוכנות איסוף וכיוצ"ב ו/או להפיץ נתונים כאלה ברבים באופן מסחרי או במסגרת מסחרית. אין להציג את האתר בתוך מסגרת גלויה או סמויה אחרת שאינה האתר ו/או החברה ואין לקשר לעמודים המצויים בתוכו אלא בהסכמתה המפורשת של החברה מראש ובכתב.<br>
                    6. כנגד המשתמש המפר ו/או המפר פרק זה יינקטו הליכים משפטיים, לרבות אך לא רק, בהתאם להוראות חוק זכויות יוצרים (תיקון מס' 5), התשע"ט-2019 ובהתאם לכל דין החל בקשר עם ההפרה.<br>




                    9. אבטחה ופרטיות<br>
                    1. המשתמש מצהיר כי ידוע לו שהשימוש באתר מחייב את מסירת פרטיו האישיים (לרבות שם, דואר אלקטרוני, מספר טלפון וכתובת) אשר יישמרו על ידי החברה במאגר מידע רשום כדין. למשתמש באתר לא תהיה כל טענה ו/או דרישה כלפי החברה ו/או מי מטעמה בקשר למסירת פרטיו והשימוש בפרטיו והוא מוותר על כל טענה ו/או תביעה כאמור, לרבות מכוח חוק הגנת הפרטיות, תשמ"א-1981.<br>
                    2. מאחר שהאתר פועל בסביבה מקוונת אזי שאין באפשרותה של החברה להבטיח חסינות הרמטית על סודיות פרטי המשתמשים ומניעת הגעתם לגורמים זרים וכן אין באפשרותה להבטיח מפני חדירות למחשביה ו/או מפני חשיפת המידע האגור על ידה. אם למרות אמצעי האבטחה הננקטים על-ידי החברה, יצליח צד שלישי כלשהו לחדור למידע הנוגע למשתמשים באתר ו/או להשתמש בו לרעה, הרי שלמשתמש לא תהיה כל טענה, תביעה ו/או דרישה כלפי החברה ו/או מי מבעליה ו/או מי ממנהליה ו/או מי מעובדיה ו/או מי מטעמה בנוגע לאמור.<br>
                    3. פרטי כרטיסי האשראי של המשתמשים המבצעים פעולות באתר אינם נשמרים במערכות החברה, מאחר וסליקת כרטיסי האשראי מתבצעת באמצעות גורם חיצוני. לאור העובדה הר"מ ולאור העובדה כי עסקינן בביצוע פעולות בסביבה מקוונת, אין באפשרות החברה להבטיח חסינות מוחלטת מפני חדירות למערכת המחשוב הקיימת ברשותה ו/או חשיפת מידע האגור בידי מבצעי פעולות בלתי חוקיות ועל כן, אם יעלה בידי צד שלישי כלשהוא לחדור למידע אשר שמור בידי החברה ו/או להשתמש בו לרעה, לא תהא למשתמש כל טענה, תביעה ו/או דרישה כלפי החברה ו/או מי מטעמה. כמו כן, גם במקרים הנובעים מ"כוח עליון" לא תהא החברה אחראית לכל נזק ו/או פגיעה מכל סוג שהוא, עקיף ו/או ישיר, שעשוי להיגרם למשתמש ו/או למי מטעמו, אם מידע כלשהוא, שמסר המשתמש באתר, יאבד ו/או יגיע לגורם עוין ו/או יעשה בו שימוש שלא בהרשאה.<br>
                    4. בעת השימוש באתר, ייאסף מידע אודות המשתמש (ובכלל זה פרטים אישיים), הדפים, "עוגיות" ("Cookies") ו/או המוצרים ו/או המודעות ו/או התכנים שהוצגו בפני המשתמש ו/או אשר גילה בהם עניין, זמן שהיית המשתמש באתר והפעולות שבוצעו באתר, כך שהחברה רשאית לשמור את המידע ולהשתמש בו לצרכיה, בכפוף למגבלות תנאי שימוש אלה והוראות כל דין, לרבות אך לא רק, לצורך הפקה וניתוח מידע סטטיסטי, ולמשתמש לא תהיה טענה ו/או תביעה ו/או דרישה כלפי החברה ו/או מי מבעליה ו/או מי ממנהליה ו/או מי מעובדיה ו/או מי מטעמה ו/או מי מטעמם בנוגע לאמור.<br>
                    5. החברה רשאית למסור נתונים סטטיסטיים כאמור לצדדים שלישיים, כל עוד אין הנתונים מתייחסים אל המשתמש באופן אישי ו/או מאפשרים את זיהויו באופן אישי - זאת, למעט חברת השליחויות אליה ימסרו פרטיו האישיים של המשתמש לצורך תיאום מסירת המוצרים אליו כאמור בסעיף 4 למדיניות המשלוחים לעיל. <br>
                    6. כאמור בסעיף 1 לעיל בפרק זה, פרטיו האישים של המשתמש יישמרו במאגר המידע רשום של החברה. כל הפרטים שימסרו על ידי המשתמש (להלן: "המידע") יוזנו במאגר כאמור כאשר ידוע למשתמש ומאושר על ידו כי לבחירת החברה, ייתכן והמאגר יוחזק ע"י מי מטעמה של החברה ו/או צד שלישי כלשהו. <br>
                    7. החברה אחראית לשמירת פרטיות פרטי המשתמשים (ככל שיהיו ברשותה), אולם היא שומרת לעצמה את הזכות לחשוף את פרטי המשתמש (ככל שאלו ידועים לה) במקרים בהם המשתמש ביצע מעשה ו/או מחדל, הפוגעים ו/או העשויים לפגוע בחברה ו/או בצדדים שלישיים כלשהם ו/או המשתמש עשה איזה שימוש בשירותי החברה לביצוע מעשה בלתי חוקי ו/או אם התקבל בידי החברה צו שיפוטי, המורה לה למסור את פרטי המשתמש לצד שלישי כלשהוא וכן בכל מחלוקת ו/או הליך משפטי.<br>
                    8. המשתמש מאשר בזאת לקבל מהחברה דיוור ישיר של חומרים פרסומיים, מבצעים, הטבות, שת"פים ועדכונים שונים בקשר עם המוצרים באתר, האתר והשירותים הניתנים במסגרתו. הפניה והעדכונים ייעשו באמצעי המדיה השונים, כגון: דואר אלקטרוני והודעות כתובות לטלפון הנייד. הסכים משתמש לקבלת דיוור, או לא הודיע על סירובו לקבלת דיוור, רשאי הוא, בכל עת, להודיע לחברה על סירובו לקבל את הדיוור. הודעת הסירוב תינתן בפנייה לחברה בדואר אלקטרוני app.picpic@gmail.com או בפנייה לשירות הלקוחות של החברה בטל: 054-546-4144 או לחילופין באמצעות מנגנון ההסרה שיימצא בכל דיוור. <br>
                    9. שליחת הודעות ע"י האתר בכל דרך שהיא לרבות דואר, דואר אלקטרוני ו/או מסרונים (לרבות לטלפון הנייד) כחלק מתפעול האתר ו/או כחלק ממתן שירות למשתמשים באתר כגון: שליחת הודעת אימות, תזכורות לצורך השלמת הזמנה, חשבונית עסקה, קבלה וכיוצא באלה אינו מהווה "מסר פרסומי". המשתמש מאשר בזאת שליחת הודעות כאמור על ידי האתר.<br>
                    10. הגלישה באתר והשימוש בשירותים הכלולים בו מהווה הסכמה מצד המשתמש לכך שהחברה תוכל לבצע פיקוח ממוחשב על השימוש בשירותים באמצעות "עוגיות" ("Cookies") ו/או אמצעים דומים למטרות שיווק ו/או פרסום ו/או קידום מכירות ו/או מכירות, למטרת פניה למשתמש בכל דרך, לרבות בדרך של דיוור ישיר של חומר שיווקי ופרסומי ו/או אחר בכל אמצעי תקשורת (לרבות ב-SMS, דוא"ל ורשתות חברתיות), עידוד נאמנות, ניתוח ומחקר סטטיסטי, עריכת סקרים וכל שימוש מקוון אחר בקשר לנושא שיווקי ו/או לצרכים פנימיים, כגון צרכי תחקור תלונות ו/או ביקורות וכדומה.<br>
                    11. החברה רשאית להשתמש בכל מידע מהאתר, לצורך בקרה ו/או פיקוח ו/או פיתוח ו/או שמירה על איכות השירותים, רמתם ותקינותם ו/או לצורך קיום הוראות כל דין, ו/או לצרכיה. <br>
                    12. במקרה של מכירת החברה, מניותיה או חלק מהן וכן במקרה של ביצוע רכישה, מיזוג או מכירה של חלק מהנכסים של החברה או כולם, החברה עשויה לחשוף או להעביר את כל המידע שיימסר ע"י המשתמש אל הגורם שירכוש את החברה, מניותיה או חלק מהן או לגורם שיירכש או ימוזג עם החברה.<br>
                    13. למשתמש לא תהיה טענה ו/או תביעה ו/או דרישה כלפי החברה ו/או מי מבעליה ו/או מי ממנהליה ו/או מי מעובדיה ו/או מי מטעמה ו/או מי מטעמם בנוגע לאמור בפרק זה.<br>
                    14. החברה רשאית לשנות מעת לעת את תנאי השימוש ומדיניות הפרטיות וממליצה למשתמשים באתר לבקר ולהתעדכן בהם מפעם לפעם.<br>

                    10. שונות<br>
                    1. כותרות הפרקים מובאות לשם נוחות והתמצאות המשתמש ולא ישמשו בשום אופן בפרשנות תנאי השימוש אלה.<br>
                    2. החברה רשאית להמחות את זכויותיה לפי תנאי שימוש אלה לכל צד שלישי כפי שתמצא לנכון וללא כל חובה מצד החברה לפרסם את דבר ההמחאה, כאמור, באתר.<br>
                    3. התכנים המועלים ומפורסמים באופן פומבי באתר, עשויים להיות מוצגים בכל מדיה אחרת, לרבות אתר סלולארי ו/או טלוויזיה ו/או כל אמצעי אחר.<br>
                    4. החברה שומרת לעצמה את הזכות לסרב להעניק גישה לאתר זה או לחלק ממנו לכל משתמש על פי שיקול דעתה הבלעדי וללא כל התראה מוקדמת.<br>
                    5. החברה שומרת לעצמה את הזכות, לתקן, להוסיף או לשנות את תנאי שימוש אלה על ידי עדכון עמוד זה, מעת לעת. כל שינוי בתנאי השימוש יכנס לתוקף מיד עם פרסומו באתר במסגרת תנאי השימוש.<br>
                    6. תנאי השימוש באתר כאמור וכל עילה משפטית הנובעת מהשימוש ו/או הפעילות באתר, לרבות תוקפם ופרשנותם של תנאי השימוש יוכפפו לדין הישראלי בלבד וסמכות השיפוט הבלעדית בכל סכסוך הנוגע לאתר ולשימוש בו תהיה נתונה לבתי המשפט המוסמכים במחוז תל-אביב-יפו. <br>
                    7. היה ויקבע שחלק כלשהו מתנאי השימוש אינו תקף או שאינו בר אכיפה, אזי שהסעיפים שנשלל תוקפם או שהוחלט כי אינם אכיפים ייחשבו כמוחלפים בסעיפים תקפים ואכיפים, אשר תוכנם תואם במידת הקירוב הגדולה ביותר את כוונת הסעיפים המקוריים ויתר סעיפי תנאי השימוש יישארו בתוקפם.<br>



                    הצהרת נגישות<br>

                    חברת PicPic  רואה חשיבות עליונה בהנגשת האתר לאנשים עם מוגבלויות ובכך לאפשר למרבית האוכלוסייה לגלוש באתר בקלות ובנוחות.
                    לאתר הותקן תוסף ההנגשה של enable אשר מתעדכן בצורה אוטומטית על פי הדרישה והשינויים בחוק ועומד בתקינות הנחיות לנגישות תכנים באינטרנט Web Content Accessibility Guidelines (WCAG) 2.0

                    להלן הפעולות שבוצעו במסגרת הנגשת האתר של החברה ובאמצעות התקנת התוסף
                    אמצעי הניווט וההתמצאות באתר פשוטים ונוחים לשימוש.
                    תכני האתר כתובים בשפה פשוטה וברורה ומאורגנים היטב באמצעות כותרות ורשימות.
                    קיים מבנה קבוע ואחיד לכלל תתי האתרים והדפים באתר.
                    האתר מותאם לצפייה בסוגי הדפדפנים השונים כמו Chrome, Mozila :
                    האתר הותאם לסביבות עבודה ברזולוציות שונות.
                    לאובייקטים הגראפיים יש חלופה טקסטואלית (alt).
                    האתר מאפשר שינוי גודל הגופן על ידי שימוש בסרגל הנגישות.
                    האתר מאפשר סימון והבלטת כותרות.
                    קיימת אפשרות להתאמת ניגודיות הצבעים באמצעות הבהרה והכהיית עמודי האתר.
                    קיימת אפשרות לסימון קישורים ע"י יצירת קו תחתי לקישור והבלטתו.
                    הקישורים באתר ברורים ומכילים הסבר לאן הם מקשרים.
                    האתר מוצג תחת שתי שפות עברית ואנגלית לנוחות המשתמשים.

                    סייגים לנגישות
                    חשוב לנו לציין כי למרות מאמצנו להנגיש את כלל הדפים באתר ותוכנו, יתכן ויתגלו חלקים באתר שטרם נגישים. אנו פועלים להמשיך ולשפר את נגישות האתר כחלק ממחויבותנו לאפשר שימוש בו עבור כלל האוכלוסייה, כולל אנשים עם מוגבלויות.
                    ככל ונתקלת בתוכן שאינו מונגש באתר, הנך מוזמן לפנות אלינו, ואנו נשמח לפעול לשם שיפור נגישותו של האתר.
                    נשמח לענות על כל שאלה ולקבל כל הערה. בכל מקרה של בקשת מידע והצעות שיפור בנושא זה ניתן ליצור קשר עם אחראי על הנגישות בחברתנו באמצעות כתובת המייל: app.picpic@gmail.com
                    הצהרת הנגישות עודכנה לאחרונה בתאריך: 7.2020


                    מדיניות פרטיות
                    1. המשתמש מצהיר כי ידוע לו שהשימוש באתר מחייב את מסירת פרטיו האישיים (לרבות שם, דואר אלקטרוני, מספר טלפון וכתובת) אשר יישמרו על ידי החברה במאגר מידע רשום כדין. למשתמש באתר לא תהיה כל טענה ו/או דרישה כלפי החברה ו/או מי מטעמה בקשר למסירת פרטיו והשימוש בפרטיו והוא מוותר על כל טענה ו/או תביעה כאמור, לרבות מכוח חוק הגנת הפרטיות, תשמ"א-1981.
                    2. מאחר שהאתר פועל בסביבה מקוונת אזי שאין באפשרותה של החברה להבטיח חסינות הרמטית על סודיות פרטי המשתמשים ומניעת הגעתם לגורמים זרים וכן אין באפשרותה להבטיח מפני חדירות למחשביה ו/או מפני חשיפת המידע האגור על ידה. אם למרות אמצעי האבטחה הננקטים על-ידי החברה, יצליח צד שלישי כלשהו לחדור למידע הנוגע למשתמשים באתר ו/או להשתמש בו לרעה, הרי שלמשתמש לא תהיה כל טענה, תביעה ו/או דרישה כלפי החברה ו/או מי מבעליה ו/או מי ממנהליה ו/או מי מעובדיה ו/או מי מטעמה בנוגע לאמור.
                    3. פרטי כרטיסי האשראי של המשתמשים המבצעים פעולות באתר אינם נשמרים במערכות החברה, מאחר וסליקת כרטיסי האשראי מתבצעת באמצעות גורם חיצוני. לאור העובדה הר"מ ולאור העובדה כי עסקינן בביצוע פעולות בסביבה מקוונת, אין באפשרות החברה להבטיח חסינות מוחלטת מפני חדירות למערכת המחשוב הקיימת ברשותה ו/או חשיפת מידע האגור בידי מבצעי פעולות בלתי חוקיות ועל כן, אם יעלה בידי צד שלישי כלשהוא לחדור למידע אשר שמור בידי החברה ו/או להשתמש בו לרעה, לא תהא למשתמש כל טענה, תביעה ו/או דרישה כלפי החברה ו/או מי מטעמה. כמו כן, גם במקרים הנובעים מ"כוח עליון" לא תהא החברה אחראית לכל נזק ו/או פגיעה מכל סוג שהוא, עקיף ו/או ישיר, שעשוי להיגרם למשתמש ו/או למי מטעמו, אם מידע כלשהוא, שמסר המשתמש באתר, יאבד ו/או יגיע לגורם עוין ו/או יעשה בו שימוש שלא בהרשאה.
                    4. בעת השימוש באתר, ייאסף מידע אודות המשתמש (ובכלל זה פרטים אישיים), הדפים, "עוגיות" ("Cookies") ו/או המוצרים ו/או המודעות ו/או התכנים שהוצגו בפני המשתמש ו/או אשר גילה בהם עניין, זמן שהיית המשתמש באתר והפעולות שבוצעו באתר, כך שהחברה רשאית לשמור את המידע ולהשתמש בו לצרכיה, בכפוף למגבלות תנאי שימוש אלה והוראות כל דין, לרבות אך לא רק, לצורך הפקה וניתוח מידע סטטיסטי, ולמשתמש לא תהיה טענה ו/או תביעה ו/או דרישה כלפי החברה ו/או מי מבעליה ו/או מי ממנהליה ו/או מי מעובדיה ו/או מי מטעמה ו/או מי מטעמם בנוגע לאמור.
                    5. החברה רשאית למסור נתונים סטטיסטיים כאמור לצדדים שלישיים, כל עוד אין הנתונים מתייחסים אל המשתמש באופן אישי ו/או מאפשרים את זיהויו באופן אישי - זאת, למעט חברת השליחויות אליה ימסרו פרטיו האישיים של המשתמש לצורך תיאום מסירת המוצרים אליו כאמור בסעיף 4 למדיניות המשלוחים לעיל. 
                    6. כאמור בסעיף 1 לעיל בפרק זה, פרטיו האישים של המשתמש יישמרו במאגר המידע רשום של החברה. כל הפרטים שימסרו על ידי המשתמש (להלן: "המידע") יוזנו במאגר כאמור כאשר ידוע למשתמש ומאושר על ידו כי לבחירת החברה, ייתכן והמאגר יוחזק ע"י מי מטעמה של החברה ו/או צד שלישי כלשהו. 
                    7. החברה אחראית לשמירת פרטיות פרטי המשתמשים (ככל שיהיו ברשותה), אולם היא שומרת לעצמה את הזכות לחשוף את פרטי המשתמש (ככל שאלו ידועים לה) במקרים בהם המשתמש ביצע מעשה ו/או מחדל, הפוגעים ו/או העשויים לפגוע בחברה ו/או בצדדים שלישיים כלשהם ו/או המשתמש עשה איזה שימוש בשירותי החברה לביצוע מעשה בלתי חוקי ו/או אם התקבל בידי החברה צו שיפוטי, המורה לה למסור את פרטי המשתמש לצד שלישי כלשהוא וכן בכל מחלוקת ו/או הליך משפטי.
                    8. המשתמש מאשר בזאת לקבל מהחברה דיוור ישיר של חומרים פרסומיים, מבצעים, הטבות, שת"פים ועדכונים שונים בקשר עם המוצרים באתר, האתר והשירותים הניתנים במסגרתו. הפניה והעדכונים ייעשו באמצעי המדיה השונים, כגון: דואר אלקטרוני והודעות כתובות לטלפון הנייד. הסכים משתמש לקבלת דיוור, או לא הודיע על סירובו לקבלת דיוור, רשאי הוא, בכל עת, להודיע לחברה על סירובו לקבל את הדיוור. הודעת הסירוב תינתן בפנייה לחברה בדואר אלקטרוני: app.picpic@gmail.com או בפנייה לשירות הלקוחות של החברה
                    בטל: 054-546-4144 או לחילופין באמצעות מנגנון ההסרה שיימצא בכל דיוור. 
                    9. שליחת הודעות ע"י האתר בכל דרך שהיא לרבות דואר, דואר אלקטרוני ו/או מסרונים (לרבות לטלפון הנייד) כחלק מתפעול האתר ו/או כחלק ממתן שירות למשתמשים באתר כגון: שליחת הודעת אימות, תזכורות לצורך השלמת הזמנה, חשבונית עסקה, קבלה וכיוצא באלה אינו מהווה "מסר פרסומי". המשתמש מאשר בזאת שליחת הודעות כאמור על ידי האתר.
                    10. הגלישה באתר והשימוש בשירותים הכלולים בו מהווה הסכמה מצד המשתמש לכך שהחברה תוכל לבצע פיקוח ממוחשב על השימוש בשירותים באמצעות "עוגיות" ("Cookies") ו/או אמצעים דומים למטרות שיווק ו/או פרסום ו/או קידום מכירות ו/או מכירות, למטרת פניה למשתמש בכל דרך, לרבות בדרך של דיוור ישיר של חומר שיווקי ופרסומי ו/או אחר בכל אמצעי תקשורת (לרבות ב-SMS, דוא"ל ורשתות חברתיות), עידוד נאמנות, ניתוח ומחקר סטטיסטי, עריכת סקרים וכל שימוש מקוון אחר בקשר לנושא שיווקי ו/או לצרכים פנימיים, כגון צרכי תחקור תלונות ו/או ביקורות וכדומה.
                    11. החברה רשאית להשתמש בכל מידע מהאתר, לצורך בקרה ו/או פיקוח ו/או פיתוח ו/או שמירה על איכות השירותים, רמתם ותקינותם ו/או לצורך קיום הוראות כל דין, ו/או לצרכיה. 
                    12. במקרה של מכירת החברה, מניותיה או חלק מהן וכן במקרה של ביצוע רכישה, מיזוג או מכירה של חלק מהנכסים של החברה או כולם, החברה עשויה לחשוף או להעביר את כל המידע שיימסר ע"י המשתמש אל הגורם שירכוש את החברה, מניותיה או חלק מהן או לגורם שיירכש או ימוזג עם החברה.
                    13. למשתמש לא תהיה טענה ו/או תביעה ו/או דרישה כלפי החברה ו/או מי מבעליה ו/או מי ממנהליה ו/או מי מעובדיה ו/או מי מטעמה ו/או מי מטעמם בנוגע לאמור בפרק זה.
                    14. החברה רשאית לשנות מעת לעת את תנאי השימוש ומדיניות הפרטיות וממליצה למשתמשים באתר לבקר ולהתעדכן בהם מפעם לפעם.

                    הוראות נוספות<br>
                    1. המשתמשים יכולים לפנות לכתובת המייל האלקטרוני המוצג לעיל ולהזמין רולאפ נוסף עם תשלום של 175 ₪ לרולאפ ללא מע"מ.<br>
                    2. החברה לא לוקחת אחריות על איכות התמונות שנשלחו או על אופיין.<br>
                    3. בסמכות החברה לשנות עלויות ולשנות תקופות של הוראות קבע בכל עת.<br>
                    4. החברה לא לוקחת אחריות על איכות הרולאפ, הריסתו/ גניבתו.<br>
                    5. החברה לא לוקחת אחריות על פציעה, מוות בכל הקשור לרולאפ. המשתמש אחראי על מיקום הרולאפ באירוע.<br>
                    6. לכל שאלה/ תמיכה טכנית אפשר לפנות לכתובת במייל האלקטרוני: app.picpic@gmail.com  בכל עת. בנוסף, תחת קטגוריית:<br>
                    "חשבון" >  "עזרה ותמיכה טכנית" , תוכלו להיחשף לשאלות ותשובות במידה והנכם נתקלים בתקלה טכנית.

                  </p>
                </q-card-section>
                <q-separator/>

                <q-card-actions align="right">
                  <q-btn flat label="אשר" color="primary" v-close-popup @click="confirmed()"/>
                </q-card-actions>
              </q-card>
            </q-dialog>
          </div>
          <br><br>
          <button @click="getLogin('passAndEmail')" class="connectMe" style="margin: auto; display:grid;">
            <span></span>
            התחבר
          </button>

          <p style="text-align: center; margin-top: 20px; font-size: 17px">או באמצעות:</p>
          <div>
            <q-btn flat style="margin-left: 20px;" @click="getLogin('google')">
              <img src="../../assets/google.png" height="50" width="50"/>
            </q-btn>
            <q-btn flat icon="facebook" size="xl" style="display: inline; color: #0028ad; margin-right: 20px; "
                   @click="getLogin('facebook')"/>
          </div>

        </form>
        <br>
      </div>
      <p style="text-align: center; font-size: 15px">עדיין לא נרשמת? <b class="reg" @click="registering">
        לחץ כאן
      </b></p>
    </div>
  </div>
</template>
<script>
import {mapActions, mapMutations, mapState} from 'vuex'
import {negative, positive} from "../../middleware/utils/notify";

const window = {
  recaptchaVerifier: undefined
}
let verify = window.recaptchaVerifier;
let signUp = [];

export default {

  name: "Register",
  data() {
    return {
      localUser: {
        email: '',
        password: ''
      },

      isPwd: true,
      accepted: false,
      fixed: false,
      value: true,
      code: false,
      phoneAuth: false,
      turn: false,
      name: null,
      lastName: null,
      phone: null,
      date: null,
      accept: false,
    }
  },
  computed: {
    ...mapState('auth', ['isFixed', 'user','isAcceptTerms','isUserExist']),
    ...mapState('businesses', ['isPay']),
    ...mapState('app', ['error'])
  },
  methods: {
    ...mapActions('auth', ['checkTerm', 'login', 'setTermService']),
    ...mapMutations('auth', ['setUser']),

    async getLogin(provider) {
      provider = provider !== 'passAndEmail' ? provider : this.localUser
     const result = await this.login(provider)
      if (!this.isUserExist) {
        return this.$q.notify(negative(result))
      }
      if (this.isAcceptTerms) this.$q.notify(positive('התחברת בהצלחה :)'))
      else return this.$q.notify(negative('יש לאשר תנאי שימוש'))
      this.choseRouter()
    },

    async confirmed() {
      await this.setTermService()
      //check if user pay
      await this.isUserPayValidate()
      this.choseRouter()
    },

    choseRouter() {
      // if (!this.isPay) return
      this.isPay ? this.$router.push('/Home') : this.$router.push('/payment');
    },
    goToForgot() {
      this.$router.push('/forgot')
    },
    registering() {
      this.$router.push('/registration')
    },
    invitedEnter() {
      this.turn = true
    },

    invitorEnter() {
      this.turn = false
    },
  },

  async created() {
    const user = JSON.parse(localStorage.getItem('user'))
    if (user) {

    }
  }
}


</script>

<style>


.forget {
  margin-top: -40px;
  margin-bottom: -20px;
  display: flex;
}

.ori {
  text-align: center;
  padding-top: 10px;
  padding-left: 20px;
  padding-right: 20px;
}

.connectMe {
  display: flex;
  flex-direction: column;
  margin: auto;
  margin-bottom: 50px;
  width: 90%;
  height: 50px;
  border: none;
  font-size: 20px;
  background-color: #000023;
  color: antiquewhite;
  border-radius: 10px;
}

.connectMe:hover {
  filter: opacity(55%);
}

.body {
  display: flex;
  align-items: center;
  justify-content: center;
}


.background {
  width: 400px;
  position: relative;
  background-color: rgba(255, 255, 255, 0.62);
  padding-bottom: 30px;
  color: #000023;
  border-radius: 10px;
}

#image2 {
  margin-top: -66px;
  text-align: center;
  align-items: center;

}

.registering {
  margin-bottom: -20px;
}

.reg:hover {
  filter: opacity(55%);
}

.forget:hover {
  filter: opacity(55%);
}
</style>

